Tekla Open API Reference for Tekla Structures 2025
StrandUnbondingData.StrandIndex Property
 The index of the strand.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int StrandIndex { get; set; }
Public Property StrandIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
StrandUnbondingData Class
Tekla.Structures.Model Namespace